---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsSpacingParam
source: html/71177196-e592-7e0e-f5e7-ce7f358b480b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsSpacingParam Property

"Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId HandrailSupportsSpacingParam { get; }
```